<h1>Критика и недостатки DevOps</h1>
<p>
Сейчас DevOps становится новым стандартом, но этот подход не лишён некоторых недостатков.
</p>
<p>
<b>Дороговизна для небольших компаний.</b> Некоторые DevOps-инструменты стоят недёшево: нужно покупать лицензию для использования, закупать сервера для развёртывания, поддерживать инфраструктуру. Кроме того, для работы может понадобиться нанять DevOps-специалиста, зарплата которого обычно начинается от 150 000 ₽ и может доходить до 400 000 ₽. Небольшим компаниям такое не по карману. При этом требования к скорости релиза у них обычно не такие высокие, а барьеры между командами меньше, поэтому они могут эффективно работать и без DevOps-подхода, а свободные деньги лучше потратить на развитие и наём более квалифицированных разработчиков.
</p>
<p>Неправильное понимание принципов DevOps.</p> DevOps появился недавно, и его принципы ещё не устоялись. Из-за этого иногда возникает недопонимание:
<ul>
    <li>программистам кажется, что их заставляют решать задачи сисадминов;</li>
    <li>менеджеры пытаются настроить непрерывный конвейер без инструментов автоматизации;</li>
    <li>в компанию нанимают DevOps-инженера в надежде, что он будет и сисадмином, и разработчиком, и тестировщиком;</li>
    <li>в компанию нанимают обычного сисадмина и поручают ему «внедрять DevOps».</li>
</ul>
<p>
    Из-за таких ошибок может показаться, что DevOps вообще не работает. Но тут проблема не в DevOps, а в неправильном подходе к его внедрению.
</p>