<h1>Плюсы использования DevOps</h1>
<p>
<b>Быстрый выпуск новых приложений и функций.</b> Параллельная работа и контейнеры позволяют избежать ситуации, когда разработчики месяцами трудятся над кодом, а тестировщики и сисадмины сидят без работы, зато во время релиза оказываются завалены по уши. Всё происходит равномерно. Кроме того, многие процессы автоматизированы, что позволяет ещё быстрее выпускать продукты на рынок.
</p>
<p>
Скорость повышается и за счёт того, что исчезают ошибки при тестировании и выпуске приложения. Вся работа происходит в единой среде, многие тесты делаются автоматически, поэтому влияние человеческого фактора сводится почти к нулю.
</p>
<p>
<b>Возможность чаще выпускать обновления и исправления.</b> Раньше разработчики могли себе позволить выпускать обновления программ раз в месяц или даже реже. Сейчас скорости другие: пользователи хотят, чтобы ошибки были исправлены сразу же, а минута простоя может стоить компании миллионы долларов. DevOps позволяет достичь таких скоростей выпуска обновлений: системы мониторинга автоматически отмечают проблемы, код уходит на доработку, потом мгновенно тестируется и сразу становится доступен пользователям. Можно выпускать по несколько обновлений в день.
</p>
<p>
<b>Ниже стоимость разработки.</b> Час работы квалифицированного разработчика, тестировщика или сисадмина стоит очень дорого. Когда специалисты сидят и ничего не делают, компания теряет деньги. Когда они тратят время на неавтоматизированную рутину, компания тоже теряет деньги. При DevOps-подходе рутина автоматизирована, а простоев нет, поэтому компания платит деньги только за реально полезное рабочее время и разработка каждой конкретной функции стоит дешевле.
</p>