<h1>Реализация методик DevOps</h1>
<p align="justify">Вы реализуете DevOps, следуя рекомендациям DevOps (описанным в следующих разделах) на протяжении всего жизненного цикла приложения. 
Некоторые из этих методик помогают ускорить, автоматизировать и улучшить выполнение конкретного этапа. Другие охватывают несколько этапов, 
помогая командам создавать целостные процессы, которые помогают повысить продуктивность.</p>
<h1>Непрерывная интеграция и непрерывная поставка (CI/CD)</h1>
<p align="justify">Непрерывная интеграция (CI) — это практика, используемая командами разработчиков для автоматизации, слияния и тестирования кода. 
CI помогает перехватывать ошибки в начале цикла разработки, что делает их менее дорогостоящими для устранения. 
Автоматические тесты выполняются в рамках процесса CI, чтобы обеспечить качество. Системы CI создают артефакты и кормят их для выпуска процессов для частого развертывания.
Непрерывная доставка (CD) — это процесс, с помощью которого код создается, тестируется и развертывается в одной или нескольких средах тестирования и рабочей среды. 
Развертывание и тестирование в нескольких средах повышает качество. Системы CD создают развертываемые артефакты, включая инфраструктуру и приложения. 
Автоматизированные процессы выпуска используют эти артефакты для выпуска новых версий и исправлений для существующих систем. 
Системы, отслеживающие и отправляющие оповещения, постоянно выполняются для обеспечения видимости всего процесса CD.</p>
<h1>Управление версиями</h1>
<p align="justify">Управление версиями — это методика работы с кодом в версиях, то есть отслеживание исправлений и истории изменений для упрощения анализа и восстановления кода. 
Эта практика обычно реализуется с помощью систем управления версиями, таких как Git, которые позволяют нескольким разработчикам совместно работать с кодом разработки. 
Эти системы обеспечивают четкий процесс объединения изменений кода в одних и тех же файлах, разрешения конфликтов и отката изменений до более ранних состояний.
Использование управления версиями является фундаментальной практикой DevOps, которая помогает командам разработчиков взаимодействовать,
делить задачи по написанию кода между участниками команд и сохранять весь код для быстрого восстановления в случае необходимости.
Управление версиями также является необходимым элементом в других методиках, таких как непрерывная интеграция и инфраструктура как код.</p>
<h1>Гибкая разработка программного обеспечения</h1>
<p align="justify">Agile — это подход к разработке программного обеспечения, в основе которого лежат принципы сотрудничества между командами, 
обратной связи с клиентами и пользователями, а также высокий уровень адаптивности к изменениям в рамках коротких циклов выпуска. 
Команды, применяющие гибкую методику, постоянно предоставляют клиентам изменения и улучшения, собирают их отзывы, а затем учитывают пожелания и потребности клиентов и адаптируются к ним.
Гибкая методика существенно отличается от других более традиционных систем, таких как каскадная методология, которая предусматривает длительные циклы выпуска с последовательными этапами.
С гибкой методикой связаны две популярные концепции — канбан и Scrum.</p>
